mhavill/MRPMG-Docklands/ESP/3_Let's_chat/Code-PIO/ESP32 Server/src/server.cpp
  WiFiManager wm;

  bool res;

  // wm.resetSettings();

  res = wm.autoConnect("AutoConnectAP", "password"); // password protected ap
  if (!res)
  {

    Serial.println("Failed to connect");

    ESP.restart();
  }

  // Start the WiFi
  // WiFi.mode(WIFI_STA);
  WiFi.hostname(device);
  strcpy((char *)ssid, WiFi.SSID().c_str());
  // WiFi.begin(ssid, password);
  Serial.println("");

  // Wait for connection
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(500);
    Serial.print(".");
  }
  Serial.println("");
  Serial.print("Connected to ");
  Serial.println(ssid);
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());

  if (MDNS.begin(device))
  {
    Serial.printf("MDNS responder started with name %s.local\n", device);
  }

  timer.every(0.5 * SECOND, npblink);
  timer.in(speed, display_text);
  timer.in(1 * SECOND, updateVUmeter);
  timer.every(3 * SECOND, wmloop);
  timer.every(10, server_client_handler);

  /***********************************
   * Web Server Handlers
   * ******************************/
  server.on("/", HTTP_GET, []()
            {
  // Serve landing page
  server.send(200, "text/html", landing_page_html);
  Serial.println("Served Landing Page"); });

  server.on("/setmode", HTTP_POST, []()
            {
  String mode = server.arg("mode");
  
  if (mode == "text") 
  {
    display_mode = MODE_TEXT;
    server.send(200, "text/html", text_message_page_html);
    Serial.println("Served Text Message Page");
  } 
  else if (mode == "animations") 
  {
    // Start animations on display
    display_mode = MODE_ANIMATIONS;
    // Start going through GIFS
    gif.begin(LITTLE_ENDIAN_PIXELS);
    gifFile = root.openNextFile();
    server.send(200, "text/html", animations_page_html);
    Serial.println("Served Animations Page");
  } 
  else if (mode == "vumeter") 
  {
    display_mode = MODE_VUMETER;
    server.send(200, "text/html", vumeter_page_html);
    Serial.println("Served VU Meter Page"); 
  } 
  else if (mode == "stop") 
  {
    // Stop current mode
    display_mode = MODE_STOP;
    server.send(200, "text/html", landing_page_html);
    Serial.println("Served Landing Page after STOP");
  } 
  else 
  {
    server.send(400, "text/plain", "Invalid mode");
    Serial.println("Invalid mode received");
  } });
  // server.on("/", MainPage); /*Client request handling: calls the function to serve HTML page */

  // server.on("/inline", []()
  //           { server.send(200, "text/plain", "this works as well"); });

  server.on("/submit", HTTP_POST, MainPageSubmit);
  // server.on("/submit", HTTP_POST, []()

  server.on("/LEDupdate", LEDControl);

  server.onNotFound(handleNotFound);




    // ... existing setup code ...

    server.on("/vumeter", HTTP_GET, handleVUMeter);
    server.on("/vuupdate", HTTP_POST, handleVUMeterUpdate);

    // ... rest of your routes ...
 
  /***************************
   * Start Web Server
   * ***************************/
  server.begin();
  Serial.println("HTTP server started");

  /***********************************
   * Initialize Display
   * ******************************/

  Serial.println("Starting MatrixPanel_I2S_DMA test...");
  // Custom pin mapping for all pins
  HUB75_I2S_CFG::i2s_pins _pins = {R1, G1, BL1, R2, G2, BL2, CH_A, CH_B, CH_C, CH_D, CH_E, LAT, OE, CLK};

  HUB75_I2S_CFG mxconfig(
      PANEL_WIDTH,  // width
      PANEL_HEIGHT, // height
      CHAIN_LENGTH, // chain length
      _pins         // pin mapping
  );

  mxconfig.i2sspeed = HUB75_I2S_CFG::HZ_20M;

  dma_display = new MatrixPanel_I2S_DMA(mxconfig);
  dma_display->begin();
  dma_display->setBrightness8(128); // 0-255
  dma_display->clearScreen();

  // Clear the layers
  gfx_layer_fg.clear();
  gfx_layer_fg.setTextWrap(false);

  gfx_layer_bg.clear();

  // set up initial messages & display mode
  display_mode = MODE_TEXT;
  lower_msg = ssid;
  upper_msg = " Melbourne Tech Guilds!  Please register now and enjoy the event. ";
  top_msg = "Welcome to";
  Serial.printf("lower_msg = %s, upper_msg = %s \n", lower_msg.c_str(), upper_msg.c_str());

  /*******************
   * Initialize LittleFS
   ******************/
  if (!LittleFS.begin(FORMAT_LITTLEFS_IF_FAILED))
  {
    Serial.println("LittleFS Mount Failed");
    return;
  }
  Serial.println("LittleFS Mounted Successfully");
}

/*******************************
 * Loop
 *******************************/

void loop(void)
{
  timer.tick();
  switch (display_mode)
  {
  case MODE_TEXT:
    // handled in display() timer
    timer.in(speed, display_text);
    break;
  case MODE_ANIMATIONS:
    timer.in(1 * SECOND, display_animations);

    break;
  case MODE_VUMETER:

    // handled in display() timer
    break;
  case MODE_STOP:
    // Do nothing
    break;
  }
}

/*******************************
 * Utility Functions
 *******************************/
bool updateVUmeter(void *)
{
  // Update VU meter display through Input FFT 
  timer.in(20, updateVUmeter);

  return true;
}

  // Handle VU meter page GET request
  void handleVUMeter()
  {
    String html = FPSTR(vumeter_page_html); // Your VU meter HTML

    // Replace placeholders
    html.replace("%DISPLAYTIME%", String(displayTime));
    html.replace("%BRIGHTNESSVALUE%", String(brightness));
    html.replace("%GAINVALUE%", String(gain));
    html.replace("%SQUELCHVALUE%", String(squelch));

    server.send(200, "text/html", html);
  }

  // Handle VU meter control updates
  void handleVUMeterUpdate()
  {
    if (server.hasArg("cmd"))
    {
      String cmd = server.arg("cmd");
      char dataType = cmd.charAt(0);
      String dataValue = cmd.substring(1);

      switch (dataType)
      {
      case 't':
        displayTime = dataValue.toInt();
        Serial.printf("Display time: %d\n", displayTime);
        break;
      case 'b':
        brightness = dataValue.toInt();
        Serial.printf("Brightness: %d\n", brightness);
        break;
      case 'g':
        gain = dataValue.toInt();
        Serial.printf("Gain: %d\n", gain);
        break;
      case 's':
        squelch = dataValue.toInt();
        Serial.printf("Squelch: %d\n", squelch);
        break;
      case 'n':
        pattern = (pattern + 1) % 6;
        Serial.printf("Pattern: %d\n", pattern);
        break;
      case 'a':
        autoChangePatterns = !autoChangePatterns;
        Serial.printf("Auto patterns: %d\n", autoChangePatterns);
        break;
      }
    }

    // Send back current state as JSON
    String response = "{";
    response += "\"displayTime\":" + String(displayTime) + ",";
    response += "\"brightness\":" + String(brightness) + ",";
    response += "\"gain\":" + String(gain) + ",";
    response += "\"squelch\":" + String(squelch) + ",";
    response += "\"auto\":" + String(autoChangePatterns ? "true" : "false");
    response += "}";

